In [1]:
import pandas as pd
import numpy as np

In [2]:
s=pd.Series(np.random.randn(9),index=[['a','a','a','b','b','b','c','c','c'],[1,2,3,1,2,3,1,2,3]])

In [3]:
s

a  1    0.511756
   2    0.486369
   3   -1.573627
b  1   -1.800599
   2   -0.098365
   3    0.543530
c  1    1.778589
   2    0.419597
   3   -0.254235
dtype: float64

In [4]:
s[0]

0.5117561431554107

In [5]:
s[1]

0.4863694601999829

In [6]:
s['a']

1    0.511756
2    0.486369
3   -1.573627
dtype: float64

In [7]:
s['a',1]

0.5117561431554107

In [9]:
s['a',2]

0.4863694601999829

In [10]:
s[:,3]

a   -1.573627
b    0.543530
c   -0.254235
dtype: float64

In [50]:
d=s.unstack()
d

          1         2         3
a  0.511756  0.486369 -1.573627
b -1.800599 -0.098365  0.543530
c  1.778589  0.419597 -0.254235

In [17]:
df=pd.DataFrame(np.random.randn(16).reshape(4,4),index=[[1,1,2,2],['a','b','a','b']],
               columns=['india','usa','uk','france'])

In [18]:
df

        india       usa        uk    france
1 a  1.003690 -1.186775  0.928576 -1.821507
  b  1.624643 -0.262891  1.457291 -1.504065
2 a  1.321557  0.327928  0.205193  0.217495
  b -0.403829  2.151866  0.728591  0.491140

In [29]:
df1=pd.DataFrame(np.random.randn(16).reshape(4,4),index=[[1,1,2,2],['a','b','a','b']],
               columns=[['india','india','uk','uk'],['hot','cold','hot','cold']])

In [30]:
df1

        india                  uk
          hot      cold       hot      cold
1 a  2.862827 -0.626938  0.057178 -0.307903
  b -0.000804 -0.139178  0.293383  0.991288
2 a  0.453369  1.299779 -1.815417 -0.007772
  b  0.080992  0.447777  0.199373 -0.140389

In [34]:
df1['india']

          hot      cold
1 a  2.862827 -0.626938
  b -0.000804 -0.139178
2 a  0.453369  1.299779
  b  0.080992  0.447777

In [35]:
df1['india','hot']

1  a    2.862827
   b   -0.000804
2  a    0.453369
   b    0.080992
Name: (india, hot), dtype: float64

In [44]:
df1.index.names=['index1','index2']

In [45]:
df1

                  india                  uk
                    hot      cold       hot      cold
index1 index2
1      a       2.862827 -0.626938  0.057178 -0.307903
       b      -0.000804 -0.139178  0.293383  0.991288
2      a       0.453369  1.299779 -1.815417 -0.007772
       b       0.080992  0.447777  0.199373 -0.140389

In [47]:
df1.columns.names=['country','temp']

In [48]:
df1

country           india                  uk
temp                hot      cold       hot      cold
index1 index2
1      a       2.862827 -0.626938  0.057178 -0.307903
       b      -0.000804 -0.139178  0.293383  0.991288
2      a       0.453369  1.299779 -1.815417 -0.007772
       b       0.080992  0.447777  0.199373 -0.140389

In [53]:
df1.swaplevel('country','temp',axis=1)

temp                hot      cold       hot      cold
country           india     india        uk        uk
index1 index2
1      a       2.862827 -0.626938  0.057178 -0.307903
       b      -0.000804 -0.139178  0.293383  0.991288
2      a       0.453369  1.299779 -1.815417 -0.007772
       b       0.080992  0.447777  0.199373 -0.140389

In [54]:
df1

country           india                  uk
temp                hot      cold       hot      cold
index1 index2
1      a       2.862827 -0.626938  0.057178 -0.307903
       b      -0.000804 -0.139178  0.293383  0.991288
2      a       0.453369  1.299779 -1.815417 -0.007772
       b       0.080992  0.447777  0.199373 -0.140389

In [60]:
df1.sum()

country  temp
india    hot     3.396384
         cold    0.981440
uk       hot    -1.265483
         cold    0.535224
dtype: float64

In [61]:
df1.sum(1)

index1  index2
1       a         1.985164
        b         1.144688
2       a        -0.070040
        b         0.587753
dtype: float64

In [66]:
df1.sum(level='temp',axis=1)

C:\Users\hp\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  """Entry point for launching an IPython kernel.

temp                hot      cold
index1 index2
1      a       2.920005 -0.934841
       b       0.292579  0.852109
2      a      -1.362048  1.292007
       b       0.280365  0.307388

In [67]:
df1.sum(level='country',axis=1)

C:\Users\hp\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  """Entry point for launching an IPython kernel.

country           india        uk
index1 index2
1      a       2.235889 -0.250725
       b      -0.139982  1.284670
2      a       1.753148 -1.823188
       b       0.528769  0.058984

In [68]:
df1.sum(level=1)

C:\Users\hp\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  """Entry point for launching an IPython kernel.

country     india                  uk
temp          hot      cold       hot      cold
index2
a        3.316196  0.672841 -1.758239 -0.315675
b        0.080188  0.308599  0.492756  0.850899

In [69]:
df1.sum(level=0)

C:\Users\hp\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  """Entry point for launching an IPython kernel.

country     india                  uk
temp          hot      cold       hot      cold
index1
1        2.862022 -0.766116  0.350561  0.683384
2        0.534362  1.747556 -1.616044 -0.148161

In [70]:
df1.groupby(level=1).sum()

country     india                  uk
temp          hot      cold       hot      cold
index2
a        3.316196  0.672841 -1.758239 -0.315675
b        0.080188  0.308599  0.492756  0.850899

In [71]:
df.sort_index()

                  india       usa        uk    france
index1 index2
1      a       1.003690 -1.186775  0.928576 -1.821507
       b       1.624643 -0.262891  1.457291 -1.504065
2      a       1.321557  0.327928  0.205193  0.217495
       b      -0.403829  2.151866  0.728591  0.491140

In [73]:
df.sort_index(level=1)

                  india       usa        uk    france
index1 index2
1      a       1.003690 -1.186775  0.928576 -1.821507
2      a       1.321557  0.327928  0.205193  0.217495
1      b       1.624643 -0.262891  1.457291 -1.504065
2      b      -0.403829  2.151866  0.728591  0.491140

In [74]:
df1

country           india                  uk
temp                hot      cold       hot      cold
index1 index2
1      a       2.862827 -0.626938  0.057178 -0.307903
       b      -0.000804 -0.139178  0.293383  0.991288
2      a       0.453369  1.299779 -1.815417 -0.007772
       b       0.080992  0.447777  0.199373 -0.140389

In [83]:
df1.loc[1,'a']

country  temp
india    hot     2.862827
         cold   -0.626938
uk       hot     0.057178
         cold   -0.307903
Name: (1, a), dtype: float64

In [87]:
df1.loc[2,'b']

country  temp
india    hot     0.080992
         cold    0.447777
uk       hot     0.199373
         cold   -0.140389
Name: (2, b), dtype: float64